eisup_2019_docmng_integration/src/Documents/абс_Платеж/абс_Платеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_Платеж</name>
  <basedOn>Document.ЗаявкаНаРасходованиеСредств</basedOn>
  <registerRecords>AccumulationRegister.абс_ПланПлатежей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>CatalogRef.абс_НазначенияПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяКатегория</name>
    <type>
      <types>CatalogRef.абс_КатегорииБС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПлана</name>
    <type>
      <types>EnumRef.абс_СтатусыПланаПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлатежей</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаОплату</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочныйЗаказ</name>
      <type>
        <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияБС</name>
      <type>
        <types>CatalogRef.абс_КатегорииБС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>CatalogRef.абс_НазначенияПлатежа</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>DocumentRef.абс_СчетНаОплату</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>DocumentRef.абс_Оплата</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ПланПлатежей/абс_ПланПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ПланПлатежей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеПлатежа</name>
    <type>
      <types>CatalogRef.абс_НазначенияПлатежа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПланаПлатежей/абс_СтатусыПланаПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПланаПлатежей</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Разутвержден</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыСчетов/абсСтатусыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыСчетов</name>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДУП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРСД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗЗ</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>ВОплату</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОплате</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВБанк</name>
  </enumValues>
  <enumValues>
    <name>ПеренесенВГК</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ОплаченЧастично</name>
    <comment>Оплачена часть П/П</comment>
  </enumValues>
  <enumValues>
    <name>Уточнить</name>
  </enumValues>
  <enumValues>
    <name>Уточнено</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеКТТК</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеАВЗ</name>
  </enumValues>
  <enumValues>
    <name>СчетСогласованАВЗ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_Платеж/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мВалютаУправленческогоУчета Экспорт; 
// Хранит список статусов в порядке их следования
Перем мСписокСтатусов Экспорт;


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		//ДанныеЗаполнения = Документы.ЗаявкаНаРасходованиеСредств.НайтиПоНомеру();
		Организация = ДанныеЗаполнения.Организация;
		Валюта = ДанныеЗаполнения.ВалютаДокумента;
		ВалютнаяСумма = ДанныеЗаполнения.СуммаДокумента;
		КурсДокумента = ДанныеЗаполнения.КурсДокумента;
		КратностьДокумента = ДанныеЗаполнения.КратностьДокумента;
		СтруктураКурсаРеглВалюта = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Дата);
		КурсРегл        = СтруктураКурсаРеглВалюта.Курс;
		КратностьРегл   = СтруктураКурсаРеглВалюта.Кратность;
		СуммаДокумента      = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(ВалютнаяСумма, Валюта, мВалютаРегламентированногоУчета, КурсДокумента,
		КурсРегл, КратностьДокумента, КратностьРегл);
		
		Контрагент = ДанныеЗаполнения.Контрагент;
		НазваниеЦФО = СокрЛП(ДанныеЗаполнения.ЦФО.Наименование);
		ОснованиеПлатежа = ДанныеЗаполнения.Описание;
		Для Каждого СтрокаПлатеж Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
			НовСтрока = СоставПлатежей.Добавить();
			НовСтрока.Валюта = СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			НовСтрока.ВалютнаяСумма = СтрокаПлатеж.СуммаВзаиморасчетов;
			НовСтрока.Сумма = СтрокаПлатеж.СуммаПлатежа;
			НовСтрока.ДоговорКонтрагента = СтрокаПлатеж.ДоговорКонтрагента;
			НовСтрока.ДатаПлатежа = ДанныеЗаполнения.ДатаРасхода;
			НовСтрока.ЗакупочныйЗаказ = ДанныеЗаполнения.ЗакупочныйЗаказ;
			НовСтрока.ЗаявкаНаОплату = ДанныеЗаполнения;
			НовСтрока.КурсВзаиморасчетов = СтрокаПлатеж.КурсВзаиморасчетов;
			НовСтрока.КратностьВзаиморасчетов = СтрокаПлатеж.КратностьВзаиморасчетов;
		КонецЦикла;
	КонецЕсли;
	глТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ТипЗнч(Контрагент) = Тип("Строка")  Тогда
		СоставПлатежей.Очистить();
		НоваяСтрока = СоставПлатежей.Добавить();
		НоваяСтрока.СуммаПлатежа = СуммаПлатежа;
		НоваяСтрока.ВалютнаяСумма = ВалютнаяСумма;
		НоваяСтрока.Курс = Курс;
		Новаястрока.Валюта = Валюта;
	КонецЕсли;	
	
	СуммаПлатежа = СоставПлатежей.Итог("СуммаПлатежа");
	ВалютнаяСумма = СоставПлатежей.Итог("ВалютнаяСумма");
	
	// Обновим статусы оплат по платежу
	СтатусОплат = Неопределено;
	
	 
	
	Если    СтатусПлана = Перечисления.абс_СтатусыПланаПлатежей.Подготовка
		ИЛИ СтатусПлана = Перечисления.абс_СтатусыПланаПлатежей.Разутвержден Тогда
		СтатусОплат = Перечисления.абсСтатусыСчетов.Исполнение;
	ИначеЕсли СтатусПлана = Перечисления.абс_СтатусыПланаПлатежей.Утвержден Тогда
		СтатусОплат = Перечисления.абсСтатусыСчетов.Утвержден;
	КонецЕсли;
	
	Если НЕ СтатусОплат = Неопределено Тогда
		ИндексСтатусаОплат = мСписокСтатусов.Найти(СтатусОплат);
		Для Каждого СтрокаПлатежа Из СоставПлатежей Цикл
			ИндексСтатусаПлатежа =  мСписокСтатусов.Найти(СтрокаПлатежа.Оплата.СтатусОплаты);
			Если ИндексСтатусаПлатежа<=ИндексСтатусаОплат Тогда
			Если НЕ СтрокаПлатежа.Оплата.СтатусОплаты = СтатусОплат Тогда
				абс_УправлениеЗакупками.ИзменитьСтатусОплатыСчета(СтрокаПлатежа.Оплата, СтатусОплат);
			КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Обработка наименования ПП
	Если Не ЗначениеЗаполнено(ЭтотОбъект.НаименованиеКонтрагента) И ЗначениеЗаполнено(ЭтотОбъект.Контрагент) 
		И ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
		НаименованиеКонтрагента = Контрагент.абс_НаименованиеПП;
		
	КонецЕсли;
	
	//
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр абс_ПланПлатежей 
	Движения.абс_ПланПлатежей.Записывать = Истина;
	Движения.абс_ПланПлатежей.Очистить();
	Движение = Движения.абс_ПланПлатежей.Добавить();
	Движение.Период = Дата;
	Движение.ЦФО = ЦФО;
	Движение.СтатьяОборотов = БюджетнаяСтатья;
	Движение.Контрагент = Контрагент;
	Движение.абс_ТипКонтрагента = ТипКонтрагента;
	Движение.абс_ЦФУ = ЦФУ;
	Движение.абс_ТипСети = ТипСети;
	Движение.абс_КВ = КВ;
	Движение.абс_ТЭО = КВ;
	Движение.абс_ТипРасхода = ТипРасхода;
	Движение.Организация = Организация;
	Движение.ВнеПлана = ВнеПлана;
	Движение.НомерНедели = НомерЖурнала;
	Движение.НазначениеПлатежа = НазначениеПлатежа;
	Движение.Валюта = Валюта;
	Движение.ВалютнаяСумма = ВалютнаяСумма;
	Движение.Сумма = СуммаПлатежа;
	Если СоставПлатежей.Количество()>0 Тогда
		
		ДокСчет = СоставПлатежей[0].Счет;
		Если ЗначениеЗаполнено(ДокСчет) Тогда
			
			Движение.СтатьяДвиженияДенежныхСредств = ДокСчет.СтатьяДвиженияДенежныхСредств;
			Если Не ЗначениеЗаполнено(Движение.абс_ТипКонтрагента) И 
				ЗначениеЗаполнено(ДокСчет.ТипКонтрагента) Тогда
				Движение.абс_ТипКонтрагента = ДокСчет.ТипКонтрагента;
				
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(Движение.абс_КВ) И 
				ЗначениеЗаполнено(ДокСчет.КВ) Тогда
				Движение.абс_КВ = ДокСчет.КВ;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Движение.абс_ТипРасхода) И 
				ЗначениеЗаполнено(ДокСчет.ТипРасхода) Тогда
				Движение.абс_ТипРасхода = ДокСчет.ТипРасхода;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Движение.абс_ТипСети) И 
				ЗначениеЗаполнено(ДокСчет.ТипСети) Тогда
				Движение.абс_ТипСети = ДокСчет.ТипСети;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Движение.абс_ТЭО) И 
				ЗначениеЗаполнено(ДокСчет.ТЭО) Тогда
				Движение.абс_ТЭО = ДокСчет.ТЭО;
			КонецЕсли;
			
			
		КонецЕсли;	
	КонецЕсли;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУправленческогоУчета 	= глЗначениеПеременной("ВалютаУправленческогоУчета");
// Заполним список статусов для определения минимального статуса документа
мСписокСтатусов = абс_БизнесПроцессы.ПолучитьМассивСтатусовСчетаНаОплату();
